# Задание 4
# Напишите программу, которая запрашивает у пользователя радиус круга и выводит его площадь. Формула площади круга

radius = float(input("Введите радиус круга: "))
S = 3.14 * radius ** 2

print("Площадь круга - ", S)